from random import choice
datas = {
    "工具":["镰刀","鸡毛掸子","水表","扳手","螺丝刀","指甲钳","梳子","电钻","锤子"],
    "动物":["公鸡","猪","犀牛","兔子","长颈鹿","眼镜蛇","狮子","鳄鱼","恐龙"],
    "文化":["书","钢管舞","皮影","诗","电影","画","印刷"],
    "武器":["双截棍","匕首","青龙偃月刀","坦克","航空母舰","手枪","弓箭","刀","金箍棒"],
    "建筑":["金字塔","桥","房子","雷峰塔","亭"],
    "自然":["黑夜","乌云","下雨","雷","极昼","风"],
    "昆虫":["蝉","蜻蜓","毛毛虫","蚊子","萤火虫","蚂蚱"],
    "交通":["红绿灯","自行车","轮船","路灯","直升机","火车"],
    "身体部位":["无名指","耳垂","屁股","脚腕","胃"],
    "成语":["掌上明珠","穿针引线","一石二鸟","花好月圆","百里挑一","坐井观天"],
    "配件":["车门","仪表盘","窗","手机壳","扣子","螺丝"],
    "职业":["程序员","医生","飞行员","歌手","老师"],
    "建材":["水泥","空心砖","瓦","玻璃","石头"],
    "体育运动":["举重","游泳","赛跑","跳远","滑冰","拳击"],
    "乐器":["古筝","笙","笛子","锣","长号","口琴","吉他"],
    "玩具":["不倒翁","魔方","风筝","拼图","陀螺"],
    "生活用品":["沙漏","电灯","鱼钩","扫把","杯子"],
    "一种行为":["上吊","随地吐痰","吵闹","吸烟","睡觉"],
    "花草":["菊花"],
    "场所":["厕所","火车站","医院","公安局","餐厅"],
    "电器":["手机","热水器","电脑","冰箱","电子秤"],
    "歌曲":["青花瓷","让我们荡起双桨","葫芦娃","小苹果","我的滑板鞋"],
    "水果":["葡萄","椰子","火龙果","菠萝","西瓜"],
    "化妆品":["眉笔","面膜","口红","睫毛膏"],
    "头饰":["鸭舌帽","发卡","发簪","皮筋"],
    "食物":["面条","大盘鸡","冰糖葫芦","包子","饺子","汤圆"],
    "蔬菜":["茄子","红薯","黄瓜","蘑菇","木耳","辣椒"],
    "景点":["大本钟","长城","富士山","东方明珠","少林寺"],
    "天文":["流星","太阳系","月球","望远镜","黑洞"],
}


def randomQuestion() -> (str,str):
    q_type = choice(list(datas))
    q = choice(datas[q_type])
    return q_type,q